backend/src/test/stress/get_random_timeline_script/get_random_timeline32.yaml
config:
  target: 'http://api.hyunmin.dev/v1'
  phases:
    - duration: 60
      arrivalRate: 32
      name: 'Get Random Timeline'

scenarios:
  - name: 'Get Random Timeline 32 user'
    flow:
      - get:
          url: '/posts/random?cursor=0'
      - think: 3
      - get:
          url: '/posts/random?cursor=3'